Mock.Random.extend({
    constellation: function(date) {
        var constellations = ['白羊座', '金牛座', '双子座', '巨蟹座', '狮子座', '处女座', '天秤座', '天蝎座', '射手座', '摩羯座', '水瓶座', '双鱼座']
        return this.pick(constellations)
    }
})

Mock.Random.extend({
    phone: function () {
        //133、149、153、173、177、180、181、189、199
        var telecom = ['133','149','153','173','177','180','181','189','199']
        //130、131、132、145、155、156、166、171、175、176、185、186
        var unicom = ['130','131','132','145','155','156','166','171','175','176','186','186']
        //134(0-8)、135、136、137、138、139、147、150、151、152、157、158、159、178、182、183、184、187、188、198
        var mobile = ['134','135','136','137','138','139','147','150','151','152','157','158','159','178','182','183','184','187','188','198']
        var phonePrefixs = telecom.concat(unicom, mobile);
        return this.pick(phonePrefixs) + Mock.mock(/\d{8}/) //Number()
    }
})